//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef COLLISIONMESH_H
#define COLLISIONMESH_H

#include "../common/types.h"

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	struct CollisionMesh
	{
		Vector3D_t*			verteces;
		UInt32_t			countVerteces;
		UInt32_t*			indeces;
		UInt32_t			countIndeces;
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !COLLISIONMESH_H
