//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef GLOBAL_H
#define GLOBAL_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	class IConsoleSystem;
	extern IConsoleSystem*					g_consoleSystem;

	//---------------------------------------------------------------------//

	class IStudioRender;
	extern IStudioRender*					g_studioRender;

	//---------------------------------------------------------------------//

	class IEngine;
	extern IEngine*							g_engine;

	//---------------------------------------------------------------------//

	class PhysicsSystem;
	extern PhysicsSystem*					g_physicsSystem;

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !GLOBAL_H

