//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "global.h"

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	IConsoleSystem*				g_consoleSystem = nullptr;
	IStudioRender*				g_studioRender = nullptr;
	IEngine*					g_engine = nullptr;
	PhysicsSystem*				g_physicsSystem = nullptr;

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//
