//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/BSOD-Games/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef ERRORS_H
#define ERRORS_H

//---------------------------------------------------------------------//

void Error_Critical( const char* Message );

//---------------------------------------------------------------------//

#endif // !ERRORS_H