//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "techniquedata.h"

// ------------------------------------------------------------------------------------ //
// Engine critical error
// ------------------------------------------------------------------------------------ //
QtNodes::NodeDataType TechniqueData::type() const
{
	return QtNodes::NodeDataType{ "techique", "Techique" };
}

// ------------------------------------------------------------------------------------ //
// Engine critical error
// ------------------------------------------------------------------------------------ //
TechniqueData::TechniqueData() :
	idTechnique( 0 )
{}

// ------------------------------------------------------------------------------------ //
// Engine critical error
// ------------------------------------------------------------------------------------ //
TechniqueData::TechniqueData( quint32 IDTechnique ) :
	idTechnique( IDTechnique )
{}

// ------------------------------------------------------------------------------------ //
// Engine critical error
// ------------------------------------------------------------------------------------ //
TechniqueData::~TechniqueData()
{}
