//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

//----------------------------------------------------------------------//

#ifdef INCLUDE_QUAD_INDECES
    0, 1, 2, 1, 3, 2
#elif defined( INCLUDE_QUAD_VERTECES )
    { -1, -1, 0 },
	{ 1, -1, 0 },
	{ -1, 1, 0 },
	{ 1, 1, 0 }
#endif

//----------------------------------------------------------------------//