//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "bsp.h"

// ------------------------------------------------------------------------------------ //
// Оператор сравнения
// ------------------------------------------------------------------------------------ //
bool le::BSPVertex::operator==( BSPVertex& Vertex )
{
	return
		position == Vertex.position &&
		textureCoord == Vertex.textureCoord &&
		lightmapCoord == Vertex.lightmapCoord &&
		normal == Vertex.normal &&
		color[ 0 ] == Vertex.color[ 0 ] &&
		color[ 1 ] == Vertex.color[ 1 ] &&
		color[ 2 ] == Vertex.color[ 2 ] &&
		color[ 3 ] == Vertex.color[ 3 ];
}

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::BSPVisData::BSPVisData() :
	numOfClusters( 0 ),
	bytesPerCluster( 0 ),
	bitsets( nullptr )
{}

// ------------------------------------------------------------------------------------ //
// Деструктор
// ------------------------------------------------------------------------------------ //
le::BSPVisData::~BSPVisData()
{
	if ( bitsets )		delete[] bitsets;
}

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::BSPEntities::BSPEntities() :
	entitiesData( nullptr )
{}

// ------------------------------------------------------------------------------------ //
// Деструктор
// ------------------------------------------------------------------------------------ //
le::BSPEntities::~BSPEntities()
{
	if ( entitiesData )		delete[] entitiesData;
}
