//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "concmd.h"

// ------------------------------------------------------------------------------------ //
// Инициализировать консольную команду
// ------------------------------------------------------------------------------------ //
void le::ConCmd::Initialize( const char* Name, const char* HelpText, ExecCallbackFn_t ExecCallback )
{
	name = Name;
	helpText = HelpText;
	execCallback = ExecCallback;
}

// ------------------------------------------------------------------------------------ //
// Выполнить команду
// ------------------------------------------------------------------------------------ //
void le::ConCmd::Exec( UInt32_t CountArguments, const char** Arguments )
{
	if ( !execCallback ) return;
	execCallback( CountArguments, Arguments );
}

// ------------------------------------------------------------------------------------ //
// Задать функцию выполнения
// ------------------------------------------------------------------------------------ //
void le::ConCmd::SetExecCallback( ExecCallbackFn_t ExecCallback )
{
	execCallback = ExecCallback;
}

// ------------------------------------------------------------------------------------ //
// Задать название команды
// ------------------------------------------------------------------------------------ //
void le::ConCmd::SetName( const char* Name )
{
	name = Name;
}

// ------------------------------------------------------------------------------------ //
// Получить название команды
// ------------------------------------------------------------------------------------ //
const char* le::ConCmd::GetName() const
{
	return name.c_str();
}

// ------------------------------------------------------------------------------------ //
// Получить описание команды
// ------------------------------------------------------------------------------------ //
const char* le::ConCmd::GetHelpText() const
{
	return helpText.c_str();
}

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::ConCmd::ConCmd() :
	name( "" ),
	execCallback( nullptr )
{}

// ------------------------------------------------------------------------------------ //
// Деструктор
// ------------------------------------------------------------------------------------ //
le::ConCmd::~ConCmd()
{}
