//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef GLOBAL_H
#define GLOBAL_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	class ConsoleSystem;
	extern ConsoleSystem*			g_consoleSystem;

	//---------------------------------------------------------------------//

	class Engine;
	extern Engine*					g_engine;

	//---------------------------------------------------------------------//

	class IStudioRender;
	extern IStudioRender*			g_studioRender;

	//---------------------------------------------------------------------//

	class IWindow;
	extern IWindow*					g_window;

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !GLOBAL_H

