//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef GAMEINFO_H
#define GAMEINFO_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	struct GameInfo
	{
		GameInfo() :
			gameDir( "" ),
			title( "" ),
			gameDLL( "" ),
			icon( "" )
		{}

		const char*			gameDir;
		const char*			title;
		const char*			gameDLL;
		const char*			icon;
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !GAMEINFO_H
