//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef IPHYSICS_SYSTEM_H
#define IPHYSICS_SYSTEM_H

//---------------------------------------------------------------------//

namespace le
{
    //---------------------------------------------------------------------//

    class IFactory;

    //---------------------------------------------------------------------//

    class IPhysicsSystem
    {
    public:
        virtual ~IPhysicsSystem() {}
        virtual IFactory*           GetFactory() const = 0;
    };

    //---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !IPHYSICS_SYSTEM_H
