//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef SHAPEBOXDESCRIPTOR_H
#define SHAPEBOXDESCRIPTOR_H

//---------------------------------------------------------------------//

namespace le
{
    //---------------------------------------------------------------------//

    struct ShapeBoxDescriptor
    {
        float       width;
        float       height;
        float       depth;
    };

    //---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !SHAPEBOXDESCRIPTOR_H
