//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef SHAPEMESHDESCRIPTOR_H
#define SHAPEMESHDESCRIPTOR_H

//---------------------------------------------------------------------//

namespace le
{
    //---------------------------------------------------------------------//

    struct ShapeMeshDescriptor
    {
        int         countVerteces;
        float*      verteces;
        int         countIndeces;
        int*        indeces;
    };

    //---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !SHAPEMESHDESCRIPTOR_H
