//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "directionallight.h"

// ------------------------------------------------------------------------------------ //
// Задать направление света
// ------------------------------------------------------------------------------------ //
void le::DirectionalLight::SetDirection( const Vector3D_t& Direction )
{
	direction = Direction;
}

// ------------------------------------------------------------------------------------ //
// Получить направление света
// ------------------------------------------------------------------------------------ //
const le::Vector3D_t& le::DirectionalLight::GetDirection() const
{
	return direction;
}

// ------------------------------------------------------------------------------------ //
// Задать цвет света
// ------------------------------------------------------------------------------------ //
void le::DirectionalLight::SetColor( const Vector4D_t& Color )
{
	color = Color;
}

// ------------------------------------------------------------------------------------ //
// Задать отражаемый цвет
// ------------------------------------------------------------------------------------ //
void le::DirectionalLight::SetSpecular( const Vector4D_t& Color )
{
	specular = Color;
}

// ------------------------------------------------------------------------------------ //
// Задать интенсивность света
// ------------------------------------------------------------------------------------ //
void le::DirectionalLight::SetIntensivity( float Intensivity )
{
	intensivity = Intensivity;
}

// ------------------------------------------------------------------------------------ //
// Получить цвет света
// ------------------------------------------------------------------------------------ //
const le::Vector4D_t& le::DirectionalLight::GetColor() const
{
	return color;
}

// ------------------------------------------------------------------------------------ //
// Получить отражаемый цвет
// ------------------------------------------------------------------------------------ //
const le::Vector4D_t& le::DirectionalLight::GetSpecular() const
{
	return specular;
}

// ------------------------------------------------------------------------------------ //
// Получить интенсивность
// ------------------------------------------------------------------------------------ //
float le::DirectionalLight::GetIntensivity() const
{
	return intensivity;
}

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::DirectionalLight::DirectionalLight() :
	intensivity( 1.f ),
	color( 1.f ),
	specular( 1.f ),
	direction( 0.f )
{}

// ------------------------------------------------------------------------------------ //
// Деструктор
// ------------------------------------------------------------------------------------ //
le::DirectionalLight::~DirectionalLight()
{}
