//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef QUAD_H
#define QUAD_H

#include "baseprimitive.h"

//----------------------------------------------------------------------//

namespace le
{
	//----------------------------------------------------------------------//

	class Quad : public BasePrimitive
	{
	public:
		Quad();
		~Quad();

		void				Create( const Vector2D_t& Size );

		UInt32_t			GetCountIndeces() const;
		UInt32_t			GetStartIndex() const;
	};

	//----------------------------------------------------------------------//
}

//----------------------------------------------------------------------//

#endif // !QUAD_H
