//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef TYPE_USAGE_BUFFER_H
#define TYPE_USAGE_BUFFER_H

#include <GL/glew.h>

//----------------------------------------------------------------------//

namespace le
{
	//----------------------------------------------------------------------//

	enum TYPE_USAGE_BUFFER
	{
		TUB_STATIC		= GL_STATIC_DRAW,
		TUB_DYNAMIC		= GL_DYNAMIC_DRAW,
		TUB_STREAM		= GL_STREAM_DRAW	
	};

	//----------------------------------------------------------------------//
}

//----------------------------------------------------------------------//

#endif // !TYPE_USAGE_BUFFER_H
