//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "engine/lifeengine.h"
#include "vertexbufferlayout.h"

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::VertexBufferLayout::VertexBufferLayout() :
	stride( 0 )
{}

// ------------------------------------------------------------------------------------ //
// Получить размер типа
// ------------------------------------------------------------------------------------ //
le::UInt32_t le::VertexBufferElement::GetSizeOfType( UInt32_t Type )
{
	switch ( Type )
	{
		case GL_FLOAT: 
		case GL_UNSIGNED_INT:	return 4;
		case GL_UNSIGNED_BYTE:	return 1;
	}

	LIFEENGINE_ASSERT( false );
	return 0;
}

// ------------------------------------------------------------------------------------ //
// Получить смещение
// ------------------------------------------------------------------------------------ //
const le::UInt32_t& le::VertexBufferLayout::GetStride()
{
	return stride;
}

// ------------------------------------------------------------------------------------ //
// Получить массив элементов
// ------------------------------------------------------------------------------------ //
const std::vector< le::VertexBufferElement >& le::VertexBufferLayout::GetElements()
{
	return elements;
}
