//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef SHAPECONEDESCRIPTOR_H
#define SHAPECONEDESCRIPTOR_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	struct ShapeConeDescriptor
	{
		float       radius;
		float       height;
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !SHAPECONEDESCRIPTOR_H
