//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef SHAPECAPSULEDESCRIPTOR_H
#define SHAPECAPSULEDESCRIPTOR_H

//---------------------------------------------------------------------//

namespace le
{
    //---------------------------------------------------------------------//

    struct ShapeCapsuleDescriptor
    {
        float       radius;
        float       height;
    };

    //---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !SHAPECAPSULEDESCRIPTOR_H
