//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef STUDIO_VERTEX_FORMAT_H
#define STUDIO_VERTEX_FORMAT_H

#include "common/types.h"

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	struct StudioVertexElement;

	//---------------------------------------------------------------------//

	struct StudioVertexFormat
	{
		UInt32_t					countElements;
		StudioVertexElement*		elements;
		UInt32_t					stride;
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !STUDIO_VERTEX_FORMAT_H
