//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/BSOD-GameEdition/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "audiosystemfactory.h"

// ------------------------------------------------------------------------------------ //
// Create object
// ------------------------------------------------------------------------------------ //
void* le::AudioSystemFactory::Create( const char* NameInterface )
{
	return nullptr;
}

// ------------------------------------------------------------------------------------ //
// Delete object
// ------------------------------------------------------------------------------------ //
void le::AudioSystemFactory::Delete( void* Object )
{
	if ( Object ) delete Object;
}
