//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef API_MAT4_H
#define API_MAT4_H

//---------------------------------------------------------------------//

typedef struct
{
	float		matrix[ 16 ];
} mat4_t;

//---------------------------------------------------------------------//

#endif // !API_MAT4_H
