//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef API_VEC3_H
#define API_VEC3_H

//---------------------------------------------------------------------//

typedef struct
{
	float		x;
	float		y;
	float		z;
} vec3_t;

//---------------------------------------------------------------------//

#endif // !API_VEC3_H
