//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef API_RAY_H
#define API_RAY_H

#include "vec3.h"

//---------------------------------------------------------------------//

typedef struct
{
	vec3f_t			origin;
	vec3f_t			direction;
} ray_t;

//---------------------------------------------------------------------//

#endif // API_RAY_H
