//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef API_VEC2_H
#define API_VEC2_H

//---------------------------------------------------------------------//

typedef struct
{
	float		x;
	float		y;
} vec2f_t;

//---------------------------------------------------------------------//

typedef struct
{
	int		x;
	int		y;
} vec2i_t;

//---------------------------------------------------------------------//

#endif // !API_VEC2_H
