//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef API_VEC4_H
#define API_VEC4_H

//---------------------------------------------------------------------//

typedef struct
{
	float		x;
	float		y;
	float		z;
	float		w;
} vec4f_t;

//---------------------------------------------------------------------//

typedef struct
{
	int		x;
	int		y;
	int		z;
	int		w;
} vec4i_t;

//---------------------------------------------------------------------//

#endif // !API_VEC4_H
