//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "engine/lifeengine.h"
#include "engine/iengine.h"
#include "engine/iconsolesystem.h"

#include "shaderdll.h"

LIFEENGINE_STDSHADERS_API( le::ShaderDLL );

// ------------------------------------------------------------------------------------ //
// Инициализировать библиотеку шейдеров
// ------------------------------------------------------------------------------------ //
bool le::ShaderDLL::Initialize( IEngine* Engine )
{
	return true;
}

// ------------------------------------------------------------------------------------ //
// Получить количество шейдеров
// ------------------------------------------------------------------------------------ //
le::UInt32_t le::ShaderDLL::GetShaderCount() const
{
	return UInt32_t();
}

// ------------------------------------------------------------------------------------ //
// Получить шейдер
// ------------------------------------------------------------------------------------ //
le::IShader* le::ShaderDLL::GetShader( UInt32_t Index ) const
{
	return nullptr;
}
