//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "testshader.h"

// ------------------------------------------------------------------------------------ //
// Инициализировать экземпляр шейдера
// ------------------------------------------------------------------------------------ //
bool le::TestShader::InitInstance( UInt32_t CountParams, IMaterialVar** MaterialVars )
{
	return false;
}

// ------------------------------------------------------------------------------------ //
// Подготовка к отрисовке элементов
// ------------------------------------------------------------------------------------ //
void le::TestShader::OnDrawElements( UInt32_t CountParams, IMaterialVar** MaterialVars )
{}

// ------------------------------------------------------------------------------------ //
// Получить название шейдера
// ------------------------------------------------------------------------------------ //
const char* le::TestShader::GetName() const
{
	return "testshader";
}

// ------------------------------------------------------------------------------------ //
// Получить запасной шейдер
// ------------------------------------------------------------------------------------ //
const char* le::TestShader::GetFallbackShader() const
{
	return nullptr;
}

// ------------------------------------------------------------------------------------ //
// Получить название параметра
// ------------------------------------------------------------------------------------ //
const char* le::TestShader::GetParamName( UInt32_t Index ) const
{
	if ( Index >= shaderParams.size() )			return nullptr;
	return shaderParams[ Index ].name;
}

// ------------------------------------------------------------------------------------ //
// Получить описание параметра
// ------------------------------------------------------------------------------------ //
const char* le::TestShader::GetParamHelp( UInt32_t Index ) const
{
	if ( Index >= shaderParams.size() )			return nullptr;
	return shaderParams[ Index ].helpString;
}

// ------------------------------------------------------------------------------------ //
// Получить стандартное значение параметра
// ------------------------------------------------------------------------------------ //
const char* le::TestShader::GetParamDefault( UInt32_t Index ) const
{
	if ( Index >= shaderParams.size() )			return nullptr;
	return shaderParams[ Index ].defaultString;
}

// ------------------------------------------------------------------------------------ //
// Получить тип параметра
// ------------------------------------------------------------------------------------ //
le::MATERIAL_VAR_TYPE le::TestShader::GetParamType( UInt32_t Index ) const
{
	if ( Index >= shaderParams.size() )			return MVT_INT;
	return shaderParams[ Index ].typeValue;
}

// ------------------------------------------------------------------------------------ //
// Получить количество параметров
// ------------------------------------------------------------------------------------ //
le::UInt32_t le::TestShader::GetCountParams() const
{
	return shaderParams.size();
}

// ------------------------------------------------------------------------------------ //
// Получить массив параметров
// ------------------------------------------------------------------------------------ //
le::ShaderParamInfo** le::TestShader::GetParams() const
{
	return nullptr;
}

// ------------------------------------------------------------------------------------ //
// Получить параметр
// ------------------------------------------------------------------------------------ //
le::ShaderParamInfo* le::TestShader::GetParam( UInt32_t Index ) const
{
	if ( Index >= shaderParams.size() ) return nullptr;
	return ( ShaderParamInfo* ) &shaderParams[ Index ];
}

// ------------------------------------------------------------------------------------ //
// Конструктор
// ------------------------------------------------------------------------------------ //
le::TestShader::TestShader()
{
	shaderParams =
	{
		{ "position", "position vertex", "0 0 0", MVT_VECTOR_3D }
	};
}
