//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#include "global.h"

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	IConsoleSystem*		g_consoleSystem = nullptr;
	IEngine*			g_engine = nullptr;
	IStudioRender*		g_studioRender = nullptr;
	MaterialSystem*		g_materialSystem = nullptr;

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//