//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2019
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef IMATERIALVAR_H
#define IMATERIALVAR_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	enum MATERIAL_VAR_TYPE
	{
		MVT_TEXTURE,
		MVT_FLOAT,
		MVT_INT,
		MVT_BOOL,
		MVT_VECTOR_2D,
		MVT_VECTOR_3D,
		MVT_VECTOR_4D,
		MVT_MATRIX,
		MVT_STRING,
		MVT_SHADER_FLAG
	};

	//---------------------------------------------------------------------//

	class IMaterialVar
	{
	public:
		//TODO: реализовать интерфейс
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !IMATERIALVAR_H

