//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/BSOD-GameEdition/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef SOUNDSTATUS_H
#define SOUNDSTATUS_H

//---------------------------------------------------------------------//

namespace le
{
	//---------------------------------------------------------------------//

	enum SOUND_STATUS
	{
		SS_PLAYING,
		SS_PAUSED,
		SS_STOPED
	};

	//---------------------------------------------------------------------//
}

//---------------------------------------------------------------------//

#endif // !SOUNDSTATUS_H
