//////////////////////////////////////////////////////////////////////////
//
//			*** lifeEngine (Двигатель жизни) ***
//				Copyright (C) 2018-2020
//
// Репозиторий движка:  https://github.com/zombihello/lifeEngine
// Авторы:				Егор Погуляка (zombiHello)
//
//////////////////////////////////////////////////////////////////////////

#ifndef GLOBAL_H
#define GLOBAL_H

#include <string>

//---------------------------------------------------------------------//

extern std::string				g_sourceFile;
extern std::string				g_outputFile;

//---------------------------------------------------------------------//

#endif // !GLOBAL_H
